:PROPERTIES:
:ID:       f17d718c-0d00-4c10-b3f9-e9e0d8295193
:END:
#+SETUPFILE:~/.gclrc/org/hugo_setup.org
#+HUGO_SLUG: build_your_own_vue_compiler_dom
#+HTML_HEAD: <meta name="category" content="vue"/>
#+HTML_HEAD: <meta name="tags" content="compiler-dom"/>
#+HTML_HEAD: <meta name="createdAt" content="2022-04-27 14:49:00"/>
#+PROPERTY: header-args :noweb no-export
#+TITLE: build your own vue compiler-dom
<badge: GCCLL | Homepage | green | / | gnu-emacs | tinder>

#+begin_box Vue3 compiler-dom :background-color green

[[https://www.cheng92.com/vue/vue-mind-map-compiler-dom/][Vue3 源码头脑风暴之 4 ☞compiler-dom - 若叶知秋]]

文章最后有交互式的[[testing][测试方法]]，可输入想看的模板得到对应的 render 函数和 AST 。
#+end_box

#+html: <br>
#+begin_details compiler-core 代码 :title-color green
[[https://blog.cheng92.com/posts/build_your_own_vue_compiler_core.html][build your own vue compiler-core]]

#+name: compiler-core
#+include: ../assets/tests/compiler-core.js src js -n -r
#+end_details

** style

compiler-dom 之前：

#+name: test-before-cd
#+begin_src js -n -r :exports both
<<compiler-core>>

logOff()
const { code } = baseCompile('<div style="width:200px" :style="{height: `200px`}" />', { filename: 'foo.vue' })
logOn()
logg('<div style="width:200px" />', code)
#+end_src

对 style 属性进行加工处理，字符串拆成对象，然后合并到，同时支持多种使用方式

1. ~<div style="width:100px">~ => ~{width:'100px'}~
2. ~<div :style="{width:'100px'}">~ => ~{width:'100px'}~
3. ~<div :style="{width:'100px'} style="height:100px">~ => ~{width:'100px',height:'100px'}~

#+name: transformStyleCD
#+begin_src js -n -r

// Parse inline CSS strings for static style attributes into an object.
// This is a NodeTransform since it works on the static `style` attribute and
// converts it into a dynamic equivalent:
// style="color: red" -> :style='{ "color": "red" }'
// It is then processed by `transformElement` and included in the generated
// props.
const transformStyleCD = node => {
  if (node.type === NodeTypes.ELEMENT) {
    node.props.forEach((p, i) => {
      if (p.type === NodeTypes.ATTRIBUTE && p.name === 'style' && p.value) {
        // replace p with an expression node
        node.props[i] = {
          type: NodeTypes.DIRECTIVE,
          name: `bind`,
          arg: createSimpleExpression(`style`, true, p.loc),
          exp: parseInlineCSS(p.value.content, p.loc),
          modifiers: [],
          loc: p.loc
        }
      }
    })
  }
}

const parseInlineCSS = (cssText, loc) => {
  const normalized = parseStringStyle(cssText)
  return createSimpleExpression(
    JSON.stringify(normalized),
    false,
    loc,
    ConstantTypes.CAN_STRINGIFY
  )
}
#+end_src

[[(parseStringStyle)][parseStringStyle]] 将字符串解析成对象 ~"width:100px"~ => ~{ width: '100px' }~

[[(stringifyStyle)][stringifyStyle]] 将对象转成字符串 ~{ width: '100px' }~ => ~"width:100px"~

[[(normalizeStyle)][normalizeStyle]] 解析 style 的值，可能是 ~"width:100px"~ 或 ~{width:'100px'}~ 也可以是
~['width:100px', {height:'100px'}]~ 的混合方式，最终都会被解析成对象
~{width:'100px', height: '100px'}~ 。

#+begin_src js -n -r :exports both
<<compiler-dom>>
const pss = s => parseStringStyle(s)
let r = pss('width:100px;height:100px')
logg('parseStringStyle', r)
const sfs = s => stringifyStyle(s)
const s = sfs(r)
logg('stringifyStyle', s)
logg('normalizeStyle', normalizeStyle([r, s, 'font-size:12px', { 'line-height': 1.2 }]))
#+end_src

red:Testing

#+begin_src js -n -r :exports both
<<compiler-dom>>

logOff()
const { code } = compile('<div style="width:200px" :style="{height: `200px`}" />', { filename: 'foo.vue' })
logOn()
logg('<div style="width:200px" />', code)
#+end_src

#+RESULTS:
#+begin_example
--------- createStructuralDirectiveTransform ---------
name=for, matches=(n) => n === name
--------- createStructuralDirectiveTransform ---------
name=/^(if|else|else-if)$/, matches=(n) => name.test(n)
--------- <div style="width:200px" /> ---------
const _Vue = Vue

return function render(_ctx, _cache) {
  with (_ctx) {
    const { normalizeStyle: _normalizeStyle, openBlock: _openBlock, createElementBlock: _createElementBlock } = _Vue

    return (_openBlock(), _createElementBlock("div", {
      style: _normalizeStyle([
        {"width":"200px"},
        {height: `200px`}
      ])
    }, null, 4))
  }
}
undefined
#+end_example

注意与 [[test-before-cd][实现 compiler-dom 之前测试结果]] 对比结果，会发现后者的 ~style~ 都会被转成对
象形式。

之前：
#+begin_src js
 style: _normalizeStyle([
   "width:200px",
   {height: `200px`}
 ])
#+end_src

之后：

#+begin_src js
style: _normalizeStyle([
  {"width":"200px"},
  {height: `200px`}
])
#+end_src

